homework/app/controllers/theaters_controller.rb

SELECT "theaters".* FROM "theaters"
---
  def index
    @theaters = Theater.all

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 2 LIMIT 1
---
  def show
    @theater = Theater.find_by_id(params[:id])

INSERT INTO "theaters" ("address", "created_at", "name", "phone_number", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "dsa"], ["created_at", Sun, 28 Apr 2013 19:41:17 UTC +00:00], ["name", "dsa"], ["phone_number", "dwq"], ["updated_at", Sun, 28 Apr 2013 19:41:17 UTC +00:00]]
---
  def create
    t = Theater.new
    t.address = params[:address]
    t.name = params[:name]
    t.phone_number = params[:phone_number]
    t.save

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 2 LIMIT 1
---
  def edit
    @theater = Theater.find_by_id(params[:id])

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 2 LIMIT 1
UPDATE "theaters" SET "title" = 'ewqeqwe', "updated_at" = '2013-04-28 19:16:05.922422' WHERE "theaters"."id" = 2
---
  def update
    @theater = Theater.find_by_id(params[:id])
    @theater.address = params[:address]
    @theater.name = params[:name]
    @theater.phone_number = params[:phone_number]
    @theater.save

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1
DELETE FROM "theaters" WHERE "theaters"."id" = ?  [["id", 1]]
---
  def destroy
    t = Theater.find_by_id(params[:id])
    t.destroy